#### groupby()

- groupby("컬럼명").count() or groupby("컬럼명").agg(function)

In [14]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
mpg_df=sns.load_dataset("mpg")
mpg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [3]:
mpg_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [4]:
# origin 컬럼 기준으로 size()
mpg_df.groupby("origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [5]:
mpg_df["origin"].value_counts()

origin
usa       249
japan      79
europe     70
Name: count, dtype: int64

In [11]:
# origin 컬럼 기준으로 평균
mpg_df.groupby("origin")["cylinders"].mean()
mpg_df.groupby("origin")["cylinders"].agg("mean")
mpg_df.groupby("origin")["cylinders"].agg(["mean","std","count"])

            mean       std  count
origin
europe  4.157143  0.500310     70
japan   4.101266  0.590414     79
usa     6.248996  1.661425    249

In [12]:
# origin, model_year 컬럼 기준으로 평균
mpg_df.groupby(["origin","model_year"])["cylinders"].mean()

origin  model_year
europe  70            4.000000
        71            4.000000
        72            4.000000
        73            4.000000
        74            4.000000
        75            4.000000
        76            4.250000
        77            4.000000
        78            4.833333
        79            4.250000
        80            4.111111
        81            4.500000
        82            4.000000
japan   70            4.000000
        71            4.000000
        72            3.800000
        73            4.250000
        74            4.000000
        75            4.000000
        76            4.500000
        77            4.166667
        78            4.000000
        79            4.000000
        80            4.076923
        81            4.333333
        82            4.000000
usa     70            7.636364
        71            6.200000
        72            6.888889
        73            7.241379
        74            6.266667
        75            6.400000
        76            6.363636
        77            6.222222
        78            6.000000
        79            6.260870
        80            4.285714
        81            4.923077
        82            4.300000
Name: cylinders, dtype: float64

In [13]:
mpg_df.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [15]:
df = pd.DataFrame(
    {
        "A" : ["ha","hi","ho","ha","ho"],
        "B" : ["one","two","one","one","two"],
        "Data1" : np.random.randn(5),
        "Data2" : np.random.randn(5)
    }
)
df

    A    B     Data1     Data2
0  ha  one -0.281286  0.294356
1  hi  two  0.437045  0.503173
2  ho  one  0.206150 -0.309683
3  ha  one -1.624475  0.175319
4  ho  two  0.258243  0.120089

In [16]:
# A열 기준으로 그룹, sum()
df.groupby("A").sum()

         B     Data1     Data2
A
ha  oneone -1.905761  0.469675
hi     two  0.437045  0.503173
ho  onetwo  0.464393 -0.189594

In [19]:
df.groupby("A")[["Data1","Data2"]].agg(["sum","mean","std"]) \
.rename(columns={"sum":"합계","mean":"평균","std":"표준편차"})

       Data1                         Data2
          합계        평균      표준편차        합계        평균      표준편차
A
ha -1.905761 -0.952880  0.949778  0.469675  0.234837  0.084171
hi  0.437045  0.437045       NaN  0.503173  0.503173       NaN
ho  0.464393  0.232196  0.036835 -0.189594 -0.094797  0.303894

In [20]:
student_list = {
    "name" : ["John","Nate","Edward","Zara","Wendy","Nate","Brian","Janny","Jeniffer","Sera"],
   "major" : [
        "Computer Science", "Computer Science", "Physics", "Psychology","Economics","Economics","Psychology", "Computer Science", "Psychology","Economics"
    ],
    "gender":["male","male","male","female","female","male","male","male","male","female"]
}
df = pd.DataFrame(student_list)
df

       name             major  gender
0      John  Computer Science    male
1      Nate  Computer Science    male
2    Edward           Physics    male
3      Zara        Psychology  female
4     Wendy         Economics  female
5      Nate         Economics    male
6     Brian        Psychology    male
7     Janny  Computer Science    male
8  Jeniffer        Psychology    male
9      Sera         Economics  female

In [23]:
groupby_major = df.groupby("major")
groupby_major.groups

{'Computer Science': [0, 1, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 6, 8]}

In [24]:
for name, group in groupby_major:
    print(f"{name} : {len(group)}")
    print(group)

Computer Science : 3
    name             major gender
0   John  Computer Science   male
1   Nate  Computer Science   male
7  Janny  Computer Science   male
Economics : 3
    name      major  gender
4  Wendy  Economics  female
5   Nate  Economics    male
9   Sera  Economics  female
Physics : 1
     name    major gender
2  Edward  Physics   male
Psychology : 3
       name       major  gender
3      Zara  Psychology  female
6     Brian  Psychology    male
8  Jeniffer  Psychology    male

In [25]:
groupby_major.size()

major
Computer Science    3
Economics           3
Physics             1
Psychology          3
dtype: int64

In [26]:
# 시리즈 => df

major_df=pd.DataFrame({"count":groupby_major.size()})
major_df

                  count
major
Computer Science      3
Economics             3
Physics               1
Psychology            3

In [27]:
major_df.reset_index()

              major  count
0  Computer Science      3
1         Economics      3
2           Physics      1
3        Psychology      3

In [28]:
df = pd.DataFrame(
    {
        "School":["Yeonhi","Yeonhi","Sungsan","Sungsan","Sungsan"],
        "Name":["Haena","Gisu","Una","Naeun","Ziho"],
        "Math":[92,70,88,92,70]
    }
)
df

    School   Name  Math
0   Yeonhi  Haena    92
1   Yeonhi   Gisu    70
2  Sungsan    Una    88
3  Sungsan  Naeun    92
4  Sungsan   Ziho    70

In [30]:
# school 그룹 / Math 평균 구하기
df.groupby("School")["Math"].mean()

School
Sungsan    83.333333
Yeonhi     81.000000
Name: Math, dtype: float64

In [32]:
# school 그룹 / Math 평균 구하기
# 시리즈 => 데이터프레임
# 1) pd.DataFrame(시리즈)
# 2) reset_index()

df_avg = df.groupby("School")["Math"].mean().reset_index().rename(columns={"Math":"Avg"})
df_avg

    School        Avg
0  Sungsan  83.333333
1   Yeonhi  81.000000

In [33]:
# df + df_avg => merge()

df["Avg"] = df.groupby("School")["Math"].transform("mean")
df

    School   Name  Math        Avg
0   Yeonhi  Haena    92  81.000000
1   Yeonhi   Gisu    70  81.000000
2  Sungsan    Una    88  83.333333
3  Sungsan  Naeun    92  83.333333
4  Sungsan   Ziho    70  83.333333

In [34]:
def grade(num):
    if num > 90:
        grade = "A"
    elif num > 80:
        grade = "B"
    elif num > 70:
        grade = "C"
    else:
        grade = "F"
    return grade

In [36]:
df["grade"] = df["Math"].apply(grade)
df

    School   Name  Math        Avg grate
0   Yeonhi  Haena    92  81.000000     A
1   Yeonhi   Gisu    70  81.000000     F
2  Sungsan    Una    88  83.333333     B
3  Sungsan  Naeun    92  83.333333     A
4  Sungsan   Ziho    70  83.333333     F

In [43]:
dates = {"yyy-mm-dd":["2005-09-28","2007-10-05","2012-12-20"]}
df = pd.DataFrame(dates)
df

    yyy-mm-dd
0  2005-09-28
1  2007-10-05
2  2012-12-20

In [44]:
# 년도만 잘라서 year 컬럼 생성

def extract_year(col):
    return col.split("-")[0]

In [47]:
"2012-12-20".split("-")

['2012', '12', '20']

In [54]:
df["year"] = df["yyyy-mm-dd"].apply(extract_year)
df

   yyyy-mm-dd  year
0  2005-09-28  2005
1  2007-10-05  2007
2  2012-12-20  2012

In [55]:
# 나이 : 2025-2005
def get_age(year, current_year=2025):
    return current_year - int(year)

In [56]:
df['age'] = df['year'].apply(get_age)
df

   yyyy-mm-dd  year  age
0  2005-09-28  2005   20
1  2007-10-05  2007   18
2  2012-12-20  2012   13

In [62]:
# 함수 리턴 : 나는 20 살입니다.
def get_introduce(age):
    return f"나는 {age}살입니다"

In [67]:
df['introduced'] = df['age'].apply(get_introduce)
df

   yyyy-mm-dd  year  age introduced
0  2005-09-28  2005   20  나는 20살입니다
1  2007-10-05  2007   18  나는 18살입니다
2  2012-12-20  2012   13  나는 13살입니다

In [65]:
def get_introduce2(row):
    return f"나는 {row.year} 년에 태어났고 {row.age} 살입니다"

In [68]:
df['introduced2'] = df.apply(get_introduce2,axis=1)
df

   yyyy-mm-dd  year  age introduced              introduced2
0  2005-09-28  2005   20  나는 20살입니다  나는 2005 년에 태어났고 20 살입니다
1  2007-10-05  2007   18  나는 18살입니다  나는 2007 년에 태어났고 18 살입니다
2  2012-12-20  2012   13  나는 13살입니다  나는 2012 년에 태어났고 13 살입니다

In [69]:
df = pd.DataFrame(
    {
        "영어" : [60,70],
        "수학" : [100,50]
    }, index=["Dave","David"]
)
df

       영어   수학
Dave   60  100
David  70   50

In [70]:
def func(df) :
    print(type(df))
    print(df.index)
    print(df.values)

In [71]:
# axis = 0(default)
df.apply(func)

<class 'pandas.core.series.Series'>
Index(['Dave', 'David'], dtype='object')
[60 70]
<class 'pandas.core.series.Series'>
Index(['Dave', 'David'], dtype='object')
[100  50]

영어    None
수학    None
dtype: object

In [72]:
df.apply(func,axis=1)

<class 'pandas.core.series.Series'>
Index(['영어', '수학'], dtype='object')
[ 60 100]
<class 'pandas.core.series.Series'>
Index(['영어', '수학'], dtype='object')
[70 50]

Dave     None
David    None
dtype: object